{
  "title": "Pensum",
  "difficulty": "Sværhedsgrad",
  "learn_following_techs": "Du lærer følgende teknologier:",
  "frontend_desc": "Frontend webudvikling beskriver den udvikling, der skal til for at kunne se hjemmesiden i browseren. Hvis du er nybegynder til programmering, anbefales denne undervisning til at starte med. Du kan altid udvide din undervisning med backend og DevOps senere.",
  "html_title": "Hvad er HTML5?",
  "html_desc": "HTML står for HyperText Markup Language og er det mest grundlæggende indenfor webudvikling. Teknologien beskriverstrukturen af hjemmesiden.",
  "css_title": "Hvad er CSS3?",
  "css_desc": "CSS betyder Cascading Style Sheets og det er en teknologi vi bruger for at definere udseendet på hjemmesiden.",
  "js_title": "Hvad er JavaScript?",
  "js_desc": "JavaScript er et programmeringssprog, der hjælper os med at bestemme, hvordan hjemmesiden opfører sig. For eksempel: hvad skal der ske, når man trykker på en knap?",
  "react_title": "Hvad er React?",
  "react_desc": "React er et JavaScript bibliotek udviklet af Facebook, og den er meget populær på jobmarkedet. Facebook og Netflix er eksempler på hjemmesider, som bruger React. Den bruges til at gøre kodningen af interaktive hjemmesider nemmere.",
  "vue_title": "Hvad er VueJS?",
  "vue_desc": "VueJS er et JavaScript framework, udviklet af Evan You. Den har med tiden fået en stor del af markedet og bruges på mange store hjemmesider. Den, ligesom React, bruges til at gøre kodningen af interaktive hjemmesider nemmere.",
  "frontend_info_title": "Information",
  "frontend_info_desc": "Du behøver ikke lære React eller VueJS, hvis du ikke vil. Begge er moderne JavaScript frameworks, og de fleste jobopslag kræver, at man kan enten React eller VueJS.",
  "backend_desc": "Backend webudvikling er det, som brugeren af din hjemmeside ikke ser. Koden på serveren er skjult, kun kendt af dig og/eller dem, du arbejder sammen med. Gennem backend får du adgang til adskillige databaser, og du afgør, hvilken side brugeren får, når han/hun besøger en bestemt adresse (URL).",
  "node_title": "Hvad er NodeJS?",
  "node_desc": "NodeJS er et JavaScript runtime, dvs. et program, der gør det muligt at køre JavaScript på serveren. JavaScript blev først udviklet til kun at køre i browseren, i hvert fald indtil NodeJS blev udviklet i 2013. Netflix er et eksempel på en hjemmeside, som bruger NodeJS i backenden.",
  "php_title": "Hvad er PHP?",
  "php_desc": "PHP er et programmeringssprog udviklet af danskeren Rasmus Lerdorf, og mere end 60% af alle hjemmesider på internettet anvender PHP serverside. Facebook er et eksempel på en hjemmeside, som bruger PHP i backenden.",
  "mongo_title": "Hvad er MongoDB?",
  "mongo_desc": "MongoDB er en database, som bruges ofte sammen med NodeJS. Den blev udviklet i 2009.",
  "mysql_title": "Hvad er MySQL?",
  "mysql_desc": "MySQL er også en database, som bruges ofte sammen med PHP. Den blev udviklet i 1995.",
  "laravel_title": "Hvad er Laravel?",
  "laravel_desc": "Laravel er et PHP Framework, som gør det nemmere at kode backenden i PHP. Den er enorm populær blandt udviklere.",
  "learn_besides_title": "Desuden lærer du:",
  "backend_learn_besides_bullet1": "Login system (inkl. oprettelse af ny bruger og glemt kodeord)",
  "backend_learn_besides_bullet2": "At modtage kortbetalinger",
  "backend_learn_besides_bullet3": "Realtime chat",
  "devops_desc": "DevOps står for Development Operations, og kort sagt beskriver server administration og hjemmeside deployment (deployment = at lægge en hjemmeside ud på nettet, på en server).",
  "devops_tech1": "Ubuntu Linux Server",
  "devops_tech2": "NGINX Webserver",
  "ubuntu_title": "Hvad er Ubuntu Linux Server?",
  "ubuntu_desc": "Linux er et operativt system, ligesom Windows eller MacOS. Android telefoner bruger Linux. Rigtig mange Smart TVs bruger Linux. 70% af alle servere på nettet bruger Linux. Det eneste sted at Linux ikke er så populær er blandt personlige komputere. Vi kommer til at lære Ubuntu, som er en af mange Linux distributioner.",
  "nginx_title": "Hvad er NGINX Webserver?",
  "nginx_desc": "NGINX er en meget populær webserver. En webserver et blot et program, der gør det muligt for en komputer (server) at køre hjemmesider.",
  "devops_learn_besides_bullet1": "SSH (en måde at få forbindelse til en Linux server på)",
  "devops_learn_besides_bullet2": "At opstille din egen email server",
  "devops_learn_besides_bullet3": "At konfigurere gratis SSL Certifikater (så din hjemmeside bliver sikker)",
  "devops_info_title": "Hvad er forskellen på NGINX Webserver og Linux Server? Begge indeholder ordet 'server'.",
  "devops_info_desc": "Rigtig godt set. Det korte af det lange er, at Linux Server er et operativt system, som 'serverer' forskellige services. NGINX Webserver er et program, der kører på Linux, og det bruges til at 'servere' hjemmesider."
}
