{
  "title": "Curriculum",
  "difficulty": "Difficulty",
  "learn_following_techs": "You will learn the following technologies:",
  "frontend_desc": "Frontend development describes what it takes to see the website in the browser. If you're new to programming, I recommend this type of development. You can always add backend and Devops later.",
  "html_title": "What is HTML5?",
  "html_desc": "HTML stands for HyperText Markup Language and is the most basic technology in frontend development. The technology describes the structure of a web page.",
  "css_title": "What is CSS3?",
  "css_desc": "CSS means Cascading Style Sheets and is the technology we use to define the appearance and styling of a website.",
  "js_title": "What is JavaScript?",
  "js_desc": "JavaScript is a programming language that helps us decide how the website behaves. For example: what happens when we click on a button?",
  "react_title": "What is React?",
  "react_desc": "React is a JavaScript library developed by Facebook and is the most popular on the job market. Facebook and Netflix are examples of websites that use React. It's used to make websites more interactive easier.",
  "vue_title": "What is VueJS?",
  "vue_desc": "VueJS is a JavaScript framework developed by Evan You. It has with time earned it's own share of the market and is used on many big websites. Like React, it's used to make websites more interactive easier.",
  "frontend_info_title": "Information",
  "frontend_info_desc": "You don't have to learn React or Vue, if you don't want to. Both are modern JavaScript frameworks and most jobs demand that you can use them.",
  "backend_desc": "Backend development is what the end user does not see. The code on the server is hidden, only known by the programmer. Through backend we get access to many databases, and you decide which page the user sees, when they visit an address (URL).",
  "node_title": "What is NodeJS?",
  "node_desc": "NodeJS is a JavaScript runtime, ie. a program that makes it possible to run JavaScript on the server. JavaScript was originally intended to be used in the browser, at least until NodeJS was introduced in 2013. Netflix is an example of a website that uses NodeJS on the backend.",
  "php_title": "What PHP?",
  "php_desc": "PHP is a backend programming language developed by Rasmus Lerdorf, and more than 60% of all websites on the internet use PHP serverside. Facebook is an example of a website that uses PHP.",
  "mongo_title": "What is MongoDB?",
  "mongo_desc": "MongoDB is a database, that is often used with NodeJS. It was introduced in 2009.",
  "mysql_title": "What is MySQL?",
  "mysql_desc": "MySQL is a database, that is often used with PHP. It was developed in 1995.",
  "laravel_title": "What is Laravel?",
  "laravel_desc": "Laravel is a PHP Framework, that makes development in PHP easier. It's very popular among developers.",
  "learn_besides_title": "You will also learn:",
  "backend_learn_besides_bullet1": "Login system (incl. creating user)",
  "backend_learn_besides_bullet2": "Credit card payments",
  "backend_learn_besides_bullet3": "Realtime chat",
  "devops_desc": "DevOps stands Development Operations, and describes server administration and website deployment (deployment = uploading a website to a server).",
  "devops_tech1": "Ubuntu Linux Server",
  "devops_tech2": "NGINX Web Server",
  "ubuntu_title": "What is Ubuntu Linux Server?",
  "ubuntu_desc": "Linux is an operating system, just like Windows or MacOS. Android phones use Linux. A lot of Smart TVs use Linux. 70% of all servers on the internet use Linux. The only place Linux is not so popular is among personal computers. We will learn Ubuntu, which is one of many Linux distributions.",
  "nginx_title": "What is NGINX Web Server?",
  "nginx_desc": "NGINX is a very popular webserver. A webserver is a program, that makes it possible for a computer (server) to run websites.",
  "devops_learn_besides_bullet1": "SSH (one of ways to get access to a Linux server)",
  "devops_learn_besides_bullet2": "To configure your own email server",
  "devops_learn_besides_bullet3": "To configure free SSL Certificates (so that your website will be secure)",
  "devops_info_title": "What is the difference between NGINX Webserver and Linux Server? Both contain the word 'server'.",
  "devops_info_desc": "To sum it up, Linux Server is an operating system, that 'serves' different services. NGINX Webserver is a program, that runs on Linux, and is used to 'serve' webpages."
}
